AccumulationRegisters/НачисленияКоммунальныхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияКоммунальныхУслуг</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПотреблениеФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотреблениеАкт</Name>
					<Comment>Потребление по акту</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Потери</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотреблениеИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Начислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Абонплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предоплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКОплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КоммунальнаяУслуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммунальныеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетныйМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗатратыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ЗатратыОбъектов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПотреблениеФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Comment>Затраты по точке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКоммунальнойУслуги</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКоммунальныхУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетныйМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
			<Comment>Виды контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>Основное взаимодествие с контрагентом - продажа, передача на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Основное взаимодествие с контрагентом - закупка и принятие на комиссию, хранение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Comment>Подотчетное лицо компании</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филиал</Name>
					<Comment>Филиал компании, одна из организаций</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственник</Name>
					<Comment>Собственник компании, осуществляющий финансирование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие контрагенты</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТК_КорректировкаДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ТК_КорректировкаДолга</Name>
			<Comment>Корректировка долга</Comment>
			<BasedOn>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПокупателямиПоДокументам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик/комитент от которого мы получили товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаПриход</Name>
					<Comment>Сумма увеличения долга контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаРасход</Name>
					<Comment>Сумма уменьшения долга контрагента</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДохода</Name>
					<Comment>Статья доходов по начислению задолженности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Comment>Статья расходов по списанию задолженности</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
					<Comment>Состав корректируемых долгов по договорам и сделкам</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорВзаиморасчетов</Name>
							<Comment>Договор, по которому ведутся взаиморасчеты с контрагентом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>Сделка, по которой корректируется долг</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ТипыСделок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УвеличениеДолга</Name>
							<Comment>Сумма, на которую надо увеличить долг контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УменьшениеДолга</Name>
							<Comment>Сумма, на которую надо уменьшить долг контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ТК_БУХ_РаботаWebСервиса/Ext/Module.bsl
Функция ПолучитьWSСсылкуБухгалтерия(Пользователь = "", Пароль = "") Экспорт 
	
	ВсеОк = Истина;	
	WS = Неопределено;
	Результат = Новый Структура;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда 
		Пользователь = "ObmenSSL";
		Пароль = "bynthghbpf";	
	КонецЕсли;
	
	Попытка
		
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/buh/ws/cwd2.1cws?wsdl", Пользователь, Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено),Ложь);
		//Определение = Новый WSОпределения("https://orders.digma.ua/Buh/cwd2.1cws?wsdl",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		//WS = Новый WSПрокси(Определение,"http://www.digma.ua/xml-exchenge", "ОбменПоПравилам", "ОбменПоПравиламSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		WS.Пользователь = Пользователь;
		WS.Пароль = Пароль;
		
	Исключение 
		ВсеОк = Ложь;
		Результат.Вставить("Сообщение", ОписаниеОшибки());		
	КонецПопытки;
	
	Результат.Вставить("Успешно", ВсеОк);
	Результат.Вставить("WS", WS);
	
	Возврат Результат;
КонецФункции


Функция ВернутьМассивДокументов(ДатаНачала, ДатаОкончания, ТипДокумента, ТолькоПроведенные, GuidOrganization, GuidPartner, GuidDepartment) Экспорт 
	
	Отказ = Ложь;
	Описание = "";
	
	Организация 	= ПолучитьСсылкуПоГУИД(GuidOrganization, "Организации", Описание, Отказ);
	Контрагент 		= ПолучитьСсылкуПоГУИД(GuidPartner, "Контрагенты", Описание, Отказ);
	Подразделение 	= ПолучитьСсылкуПоГУИД(GuidDepartment, "ПодразделенияКомпании", Описание, Отказ);
	
	Если Не Отказ Тогда 
		Попытка
			МассивДокументовТип = ФабрикаXDTO.Тип("http://www.digma.ua", "ReturnArrayDocumentsBUH");
			Результат = ФабрикаXDTO.Создать(МассивДокументовТип);	
		Исключение
			Описание = ОписаниеОшибки();
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если Не Отказ Тогда 
		Если ТипДокумента = "ПоступлениеТоваров" Тогда
			ВыборкаДок = ВыборкаПоступлениеТоваров(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение, Ложь);
		ИначеЕсли ТипДокумента = "ПоступлениеТоваровТранзит" Тогда 
			ВыборкаДок = ВыборкаПоступлениеТоваров(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение, Истина);
		ИначеЕсли ТипДокумента = "ВозвратПоставщику" Тогда 
			ВыборкаДок = ВыборкаВозвратТоваровПоставщику(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение, Ложь);
		ИначеЕсли ТипДокумента = "ВозвратПоставщикуТранзит" Тогда 	
			ВыборкаДок = ВыборкаВозвратТоваровПоставщику(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение, Истина);
		ИначеЕсли ТипДокумента = "РеализацияТоваров" Тогда 
			ВыборкаДок = ВыборкаРеализацияТоваров(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение);
		ИначеЕсли ТипДокумента = "ВозвратОтПокупателя" Тогда 
			ВыборкаДок = ВыборкаВозвратОтПокупателя(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение);
		ИначеЕсли ТипДокумента = "КорректировкаДолга" Тогда 
			ВыборкаДок = ВыборкаКорректировкаДолга(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение);	
		Иначе
			Отказ = Истина;
			Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"Не поддерживается загрузка документа с типом ""%1""",
			ТипДокумента);
		КонецЕсли;
	КонецЕсли;
	
	
	Если Не Отказ Тогда		
		Попытка
			ДокументТип = Результат.Свойства().Получить("DocumentsList").Тип;
			
			Пока ВыборкаДок.Следующий() Цикл 
				СтрокаТаблицы = ФабрикаXDTO.Создать(ДокументТип);
				СтрокаТаблицы.DateTime = ВыборкаДок.Дата;
				СтрокаТаблицы.NumberDoc = СокрЛП(ВыборкаДок.Номер);
				СтрокаТаблицы.GuidDoc = ЗначениеВСтрокуВнутр(ВыборкаДок.Ссылка.УникальныйИдентификатор());
				СтрокаТаблицы.OrganizationName = ВыборкаДок.Организация;
				СтрокаТаблицы.PartnerName = ВыборкаДок.Контрагент;
				СтрокаТаблицы.DepartmentName = ВыборкаДок.Подразделение;
				
				Результат.DocumentsList.Добавить(СтрокаТаблицы);
			КонецЦикла;
		Исключение
			Отказ = Истина;
			Описание = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;		
	
	Результат.Status = Не Отказ;
	Результат.Description = Описание;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьСсылкуПоГУИД(СтрокаГУИД, ТипСправочника, Описание, Отказ)
	
	Ссылка = Неопределено;
	
	Если ЗначениеЗаполнено(СтрокаГУИД) Тогда 		
		
		Попытка
			ГУИД = Новый УникальныйИдентификатор(СтрокаГУИД);
			нСсылка = Справочники[ТипСправочника].ПолучитьСсылку(ГУИД);
			Если ОбщегоНазначения.СсылкаСуществует(нСсылка) Тогда 
				Ссылка = нСсылка;
			Иначе
				Отказ = Истина;
			КонецЕсли;
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
		Если Ссылка = Неопределено Тогда 
			Описание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1Ошибка получения элемента справочника ""%2"" по идентификатору <%3>",
			?(Не ПустаяСтрока(Описание), Описание + Символы.ПС, ""),
			ТипСправочника,
			СтрокаГУИД);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

Функция ВыборкаПоступлениеТоваров(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение, Транзит)
	
	ЕстьОрганизация = ЗначениеЗаполнено(Организация);
	ЕстьКонтрагент = ЗначениеЗаполнено(Контрагент);
	ЕстьПодразделение = ЗначениеЗаполнено(Подразделение);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваров.Ссылка КАК Ссылка,
	|	ПоступлениеТоваров.Дата КАК Дата,
	|	ПоступлениеТоваров.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваров.Организация) КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваров.ПодразделениеКомпании) КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоступлениеТоваров.Контрагент) КАК Контрагент
	|ИЗ
	|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|ГДЕ
	|	ПоступлениеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ПоступлениеТоваров.ПометкаУдаления
	|	И ПоступлениеТоваров.РегламентированныйУчет				   
	|	%1
	|	%2
	|	%3
	|	%4
	|	%5				   
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	Если ЕстьОрганизация Тогда 
		Запрос.УстановитьПараметр("Организация", Организация);		
	КонецЕсли;
	Если ЕстьКонтрагент Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);		
	КонецЕсли;
	Если ЕстьПодразделение Тогда 
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);		
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	ТекстЗапроса,
	?(ТолькоПроведенные, "И ПоступлениеТоваров.Проведен", ""),
	?(Транзит, "И ПоступлениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеТоваровТранзиты)", "И ПоступлениеТоваров.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеТоваровТранзиты)"),
	?(ЕстьОрганизация, "И ПоступлениеТоваров.Организация = &Организация", ""),
	?(ЕстьКонтрагент, "И ПоступлениеТоваров.Контрагент = &Контрагент", ""),
	?(ЕстьПодразделение, "И ПоступлениеТоваров.ПодразделениеКомпании = &ПодразделениеКомпании", ""));
	
	Возврат Запрос.Выполнить().Выбрать();						
	
КонецФункции

Функция ВыборкаВозвратТоваровПоставщику(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение, Транзит)
	
	ЕстьОрганизация = ЗначениеЗаполнено(Организация);
	ЕстьКонтрагент = ЗначениеЗаполнено(Контрагент);
	ЕстьПодразделение = ЗначениеЗаполнено(Подразделение);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Организация) КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.ПодразделениеКомпании) КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Контрагент) КАК Контрагент
	|ИЗ
	|	Документ.ВозвратПоставщику КАК Документ
	|ГДЕ
	|	Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.РегламентированныйУчет				   
	|	%1
	|	%2
	|	%3
	|	%4
	|	%5				   				   
	|				   
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	Если ЕстьОрганизация Тогда 
		Запрос.УстановитьПараметр("Организация", Организация);		
	КонецЕсли;
	Если ЕстьКонтрагент Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);		
	КонецЕсли;
	Если ЕстьПодразделение Тогда 
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);		
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	ТекстЗапроса,
	?(ТолькоПроведенные, "И Документ.Проведен", ""),
	?(Транзит, "И Документ.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ВозвратТоваровПоставщикуТранзиты)", "И Документ.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.ВозвратТоваровПоставщикуТранзиты)"),
	?(ЕстьОрганизация, "И Документ.Организация = &Организация", ""),
	?(ЕстьКонтрагент, "И Документ.Контрагент = &Контрагент", ""),
	?(ЕстьПодразделение, "И Документ.ПодразделениеКомпании = &ПодразделениеКомпании", ""));
	
	Возврат Запрос.Выполнить().Выбрать();			
	
КонецФункции

Функция ВыборкаРеализацияТоваров(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение)
	
	ЕстьОрганизация = ЗначениеЗаполнено(Организация);
	ЕстьКонтрагент = ЗначениеЗаполнено(Контрагент);
	ЕстьПодразделение = ЗначениеЗаполнено(Подразделение);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Организация) КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.ПодразделениеКомпании) КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Контрагент) КАК Контрагент
	|ИЗ
	|	Документ.РеализацияТоваров КАК Документ
	|ГДЕ
	|	Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.РегламентированныйУчет
	|	И Документ.ХозОперация <> ЗНАЧЕНИЕ(Справочник.ХозОперации.АктОбОказанииУслуг)
	|	%1
	|	%2
	|	%3
	|	%4			   				   				   
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	Если ЕстьОрганизация Тогда 
		Запрос.УстановитьПараметр("Организация", Организация);		
	КонецЕсли;
	Если ЕстьКонтрагент Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);		
	КонецЕсли;
	Если ЕстьПодразделение Тогда 
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);		
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	ТекстЗапроса,
	?(ТолькоПроведенные, "И Документ.Проведен", ""),
	?(ЕстьОрганизация, "И Документ.Организация = &Организация", ""),
	?(ЕстьКонтрагент, "И Документ.Контрагент = &Контрагент", ""),
	?(ЕстьПодразделение, "И Документ.ПодразделениеКомпании = &ПодразделениеКомпании", ""));
	
	Возврат Запрос.Выполнить().Выбрать();			
	
КонецФункции

Функция ВыборкаВозвратОтПокупателя(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение)
	
	ЕстьОрганизация = ЗначениеЗаполнено(Организация);
	ЕстьКонтрагент = ЗначениеЗаполнено(Контрагент);
	ЕстьПодразделение = ЗначениеЗаполнено(Подразделение);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Организация) КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.ПодразделениеКомпании) КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Контрагент) КАК Контрагент
	|ИЗ
	|	Документ.ВозвратОтПокупателя КАК Документ
	|ГДЕ
	|	Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.РегламентированныйУчет
	|	%1
	|	%2
	|	%3
	|	%4			   				   				   
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	Если ЕстьОрганизация Тогда 
		Запрос.УстановитьПараметр("Организация", Организация);		
	КонецЕсли;
	Если ЕстьКонтрагент Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);		
	КонецЕсли;
	Если ЕстьПодразделение Тогда 
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);		
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	ТекстЗапроса,
	?(ТолькоПроведенные, "И Документ.Проведен", ""),
	?(ЕстьОрганизация, "И Документ.Организация = &Организация", ""),
	?(ЕстьКонтрагент, "И Документ.Контрагент = &Контрагент", ""),
	?(ЕстьПодразделение, "И Документ.ПодразделениеКомпании = &ПодразделениеКомпании", ""));
	
	Возврат Запрос.Выполнить().Выбрать();			
	
КонецФункции

Функция ВыборкаКорректировкаДолга(ДатаНачала, ДатаОкончания, ТолькоПроведенные, Организация, Контрагент, Подразделение)
	
	ЕстьОрганизация = ЗначениеЗаполнено(Организация);
	ЕстьКонтрагент = ЗначениеЗаполнено(Контрагент);
	ЕстьПодразделение = ЗначениеЗаполнено(Подразделение);
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.Номер КАК Номер,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Организация) КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.ПодразделениеКомпании) КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Документ.Контрагент) КАК Контрагент
	|ИЗ
	|	Документ.ТК_КорректировкаДолга КАК Документ
	|ГДЕ
	|	Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ Документ.ПометкаУдаления
	|	И Документ.РегламентированныйУчет
	|	%1
	|	%2
	|	%3
	|	%4			   				   				   				   				   
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОкончания);
	
	Если ЕстьОрганизация Тогда 
		Запрос.УстановитьПараметр("Организация", Организация);		
	КонецЕсли;
	Если ЕстьКонтрагент Тогда 
		Запрос.УстановитьПараметр("Контрагент", Контрагент);		
	КонецЕсли;
	Если ЕстьПодразделение Тогда 
		Запрос.УстановитьПараметр("ПодразделениеКомпании", Подразделение);		
	КонецЕсли;
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	ТекстЗапроса,
	?(ТолькоПроведенные, "И Документ.Проведен", ""),
	?(ЕстьОрганизация, "И Документ.Организация = &Организация", ""),
	?(ЕстьКонтрагент, "И Документ.Контрагент = &Контрагент", ""),
	?(ЕстьПодразделение, "И Документ.ПодразделениеКомпании = &ПодразделениеКомпании", ""));
	
	Возврат Запрос.Выполнить().Выбрать();			
	
КонецФункции

//Гамазин
Функция ПолучитьМассивОКПОВнутреннихКонтрагентов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отказ = Ложь;
	
	Попытка
		МассивОКПОТип = ФабрикаXDTO.Тип("http://www.digma.ua", "ReturnInnerContragents");
		МассивОКПО = ФабрикаXDTO.Создать(МассивОКПОТип);	
		
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		|	Выразить(Контрагенты.КодПоЕДРПОУ как Строка(10)) как ОКПО
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	И Контрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Внутренний)";
		
		
		Выборка = Запр.выполнить().Выбрать();
		
		Пока Выборка.Следующий() цикл
			Если СокрЛП(Выборка.ОКПО) <> "" тогда
				МассивОКПО.OKPO.Добавить(СокрЛП(Выборка.ОКПО));
			КонецЕсли;	
		КонецЦикла;	
	Исключение
		Отказ = Истина;
	КонецПопытки;
	
	Если не Отказ тогда
		Возврат МассивОКПО;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции	
//окончание Гамазин

Функция НачисленияПоКоммунальнымУслугам(Месяц, Отчет = Ложь)	Экспорт
	
	КоммунальнаяУслуга = Новый СписокЗначений;
	КоммунальнаяУслуга.Добавить(Справочники.КоммунальныеУслуги.НайтиПоКоду("000000012"));		//	ХарьковЭнергоСбыт (банк)
	КоммунальнаяУслуга.Добавить(Справочники.КоммунальныеУслуги.НайтиПоКоду("000000019"));		//	ХарьковЭнергоСбыт Безучетка
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияКоммунальныхУслуг.Регистратор КАК Регистратор,
	|	НачисленияКоммунальныхУслуг.КоммунальнаяУслуга.Договор КАК Договор,
	|	ПРЕДСТАВЛЕНИЕ(НачисленияКоммунальныхУслуг.КоммунальнаяУслуга.ВидКоммунальнойУслуги) КАК ВидКоммунальнойУслуги,
	|	НачисленияКоммунальныхУслуг.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	НачисленияКоммунальныхУслуг.ПотреблениеИтого КАК ПотреблениеИтого,
	|	НачисленияКоммунальныхУслуг.Начислено КАК Начислено,
	|	НачисленияКоммунальныхУслуг.СуммаКОплате КАК СуммаКОплате,
	|	ВложенныйЗапросПотребители.Потребитель ЕСТЬ НЕ NULL  КАК ЕстьПотребитель,
	|	ВЫРАЗИТЬ(ВложенныйЗапросПотребители.Потребитель КАК Справочник.ТорговыеПлощадки) КАК Потребитель
	|ПОМЕСТИТЬ ВТ_Начисления
	|ИЗ
	|	РегистрНакопления.НачисленияКоммунальныхУслуг КАК НачисленияКоммунальныхУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТорговыеПлощадкиПотребители.Ссылка КАК Донар,
	|			ТорговыеПлощадкиПотребители.Ссылка КАК Потребитель
	|		ИЗ
	|			Справочник.ТорговыеПлощадки.Потребители КАК ТорговыеПлощадкиПотребители
	|		ГДЕ
	|			ТорговыеПлощадкиПотребители.Потребитель ССЫЛКА Справочник.ТорговыеПлощадки
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ТорговыеПлощадкиПотребители.Ссылка,
	|			ТорговыеПлощадкиПотребители.Потребитель
	|		ИЗ
	|			Справочник.ТорговыеПлощадки.Потребители КАК ТорговыеПлощадкиПотребители
	|		ГДЕ
	|			ТорговыеПлощадкиПотребители.Потребитель ССЫЛКА Справочник.ТорговыеПлощадки) КАК ВложенныйЗапросПотребители
	|		ПО НачисленияКоммунальныхУслуг.ТорговаяПлощадка = ВложенныйЗапросПотребители.Донар
	|ГДЕ
	|	НачисленияКоммунальныхУслуг.ОтчетныйМесяц = &ОтчетныйМесяц
	|	И НачисленияКоммунальныхУслуг.КоммунальнаяУслуга В ИЕРАРХИИ(&КоммунальнаяУслуга)
	|	И НачисленияКоммунальныхУслуг.Начислено > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Начисления.Регистратор КАК Регистратор,
	|	""00000000-0000-0000-0000-000000000000"" КАК ГуидДок,
	|	ВТ_Начисления.Договор КАК Договор,
	|	ВТ_Начисления.ВидКоммунальнойУслуги КАК ВидКоммунальнойУслуги,
	|	ВТ_Начисления.Договор.Код КАК КодДоговор,
	|	ВТ_Начисления.Договор.Подразделение.Код КАК КодПодразделение,
	|	ВТ_Начисления.Договор.Организация.Код КАК КодОрганизация,
	|	ВТ_Начисления.Договор.Контрагент.Код КАК КодКонтрагент,
	|	ВТ_Начисления.ЕстьПотребитель КАК ЕстьПотребитель,
	|	ВТ_Начисления.ТорговаяПлощадка КАК ТорговаяПлощадкаСсылка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Начисления.ТорговаяПлощадка) КАК ТорговаяПлощадка,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Начисления.Потребитель) КАК Потребитель,
	|	ВТ_Начисления.Потребитель КАК ПотребительСсылка,
	|	ВЫБОР
	|		КОГДА ВТ_Начисления.ЕстьПотребитель
	|			ТОГДА ВТ_Начисления.Потребитель.Код
	|		ИНАЧЕ ВТ_Начисления.ТорговаяПлощадка.Код
	|	КОНЕЦ КАК КодТорговаяПлощадка,
	|	ВТ_Начисления.ПотреблениеИтого КАК ПотреблениеИтого,
	|	ВТ_Начисления.Начислено КАК Начислено,
	|	ВТ_Начисления.СуммаКОплате КАК СуммаКОплате,
	|	ЕСТЬNULL(ЗатратыОбъектов.ПотреблениеФакт, 0) КАК ПотреблениеФакт
	|ИЗ
	|	ВТ_Начисления КАК ВТ_Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗатратыОбъектов КАК ЗатратыОбъектов
	|		ПО ВТ_Начисления.Потребитель = ЗатратыОбъектов.ТорговаяПлощадка
	|			И ВТ_Начисления.Регистратор = ЗатратыОбъектов.Регистратор
	|ИТОГИ
	|	МАКСИМУМ(ЕстьПотребитель),
	|	СУММА(ПотреблениеФакт)
	|ПО
	|	Регистратор,
	|	Договор,
	|	ТорговаяПлощадкаСсылка";
	
	Запрос.УстановитьПараметр("КоммунальнаяУслуга", КоммунальнаяУслуга);
	Запрос.УстановитьПараметр("ОтчетныйМесяц", Месяц);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Отчет Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
	
	ДЗ = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого стрДок Из ДЗ.Строки Цикл
		стрДок.ГуидДок = Строка(стрДок.Регистратор.УникальныйИдентификатор());
	КонецЦикла;
	
	ДЗ.Колонки.Удалить("Регистратор");
	ДЗ.Колонки.Удалить("ТорговаяПлощадкаСсылка");
	ДЗ.Колонки.Удалить("ПотребительСсылка");
	
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ДЗ);	
	
	Возврат СтрокаXML;
	
КонецФункции
